FocusGroup8/FocusLamp_DEMO2/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Example Configuration
#
CONFIG_EXAMPLE_ENABLE_DISPLAY=n
CONFIG_EXAMPLE_ENABLE_CAMERA=y
CONFIG_EXAMPLE_RUN_CAMERA_TEST=y
CONFIG_EXAMPLE_ENABLE_SYSMON=y
# end of Example Configuration

#
# Component config
#

#
# Hardware Settings
#

#
# Chip revision
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# end of Chip revision
# end of Hardware Settings

#
# Power Management
#
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
# end of Power Management

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# PSRAM config
#
CONFIG_SPIRAM_ECC_ENABLE=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# end of PSRAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY=y
# end of ESP System Settings

#
# mbedTLS
#
CONFIG_MBEDTLS_CMAC_C=y
# end of mbedTLS

#
# Espressif Camera Sensors Configurations
#

#
# Camera Sensor Configuration
#

#
# Select and Set Camera Sensor
#
CONFIG_CAMERA_OV5647=y

#
# Choose supported formats for MIPI CSI interface
#
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
# end of Choose supported formats for MIPI CSI interface

CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X640_50FPS=y
# end of Select and Set Camera Sensor
# end of Camera Sensor Configuration
# end of Espressif Camera Sensors Configurations
# end of Component config

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
